# Resumen de los datos: dimensiones y estructuras

In [4]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [5]:
%cd drive/My\ Drive/Investigacion/Datasets

[Errno 2] No such file or directory: 'drive/My Drive/Investigacion/Datasets'
/content/drive/My Drive/Investigacion/Datasets

In [6]:
import pandas as pd
import os

In [7]:
#mainpath = "/home/piero/Documentos/Cursos/machine-learning-python/datasets"
#filename = "titanic/titanic3.csv"
#fullpath = os.path.join(mainpath,filename)

fullpath = "titanic/titanic3.csv"

In [8]:
data = pd.read_csv(fullpath)
data.head(10)

   pclass  survived  ...   body                        home.dest
0       1         1  ...    NaN                     St Louis, MO
1       1         1  ...    NaN  Montreal, PQ / Chesterville, ON
2       1         0  ...    NaN  Montreal, PQ / Chesterville, ON
3       1         0  ...  135.0  Montreal, PQ / Chesterville, ON
4       1         0  ...    NaN  Montreal, PQ / Chesterville, ON
5       1         1  ...    NaN                     New York, NY
6       1         1  ...    NaN                       Hudson, NY
7       1         0  ...    NaN                      Belfast, NI
8       1         1  ...    NaN              Bayside, Queens, NY
9       1         0  ...   22.0              Montevideo, Uruguay

[10 rows x 14 columns]

In [9]:
data.tail()

      pclass  survived                       name  ... boat   body  home.dest
1304       3         0       Zabour, Miss. Hileni  ...  NaN  328.0        NaN
1305       3         0      Zabour, Miss. Thamine  ...  NaN    NaN        NaN
1306       3         0  Zakarian, Mr. Mapriededer  ...  NaN  304.0        NaN
1307       3         0        Zakarian, Mr. Ortin  ...  NaN    NaN        NaN
1308       3         0         Zimmerman, Mr. Leo  ...  NaN    NaN        NaN

[5 rows x 14 columns]

In [10]:
data.shape # filas y columnas

(1309, 14)

In [11]:
data.columns.values

array(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype=object)

Resumen de los estad√≠sticos b√°sicos de las variables num√©ricas

In [12]:
data.describe()

            pclass     survived  ...         fare        body
count  1309.000000  1309.000000  ...  1308.000000  121.000000
mean      2.294882     0.381971  ...    33.295479  160.809917
std       0.837836     0.486055  ...    51.758668   97.696922
min       1.000000     0.000000  ...     0.000000    1.000000
25%       2.000000     0.000000  ...     7.895800   72.000000
50%       3.000000     0.000000  ...    14.454200  155.000000
75%       3.000000     1.000000  ...    31.275000  256.000000
max       3.000000     1.000000  ...   512.329200  328.000000

[8 rows x 7 columns]

In [13]:
data.dtypes

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

# Missing values

In [14]:
pd.isnull(data["body"])

0        True
1        True
2        True
3       False
4        True
        ...
1304    False
1305     True
1306    False
1307     True
1308     True
Name: body, Length: 1309, dtype: bool

In [15]:
pd.notnull(data["body"])

0       False
1       False
2       False
3        True
4       False
        ...
1304     True
1305    False
1306     True
1307    False
1308    False
Name: body, Length: 1309, dtype: bool

In [16]:
# ravel compre un unico array de datos para aplicar suma los true
pd.isnull(data["body"]).values.ravel().sum()

1188

In [17]:
pd.notnull(data["body"]).values.ravel().sum()

121

Los valores que faltan en un data set pueden venir por dos razones:
* Extracci√≥n de los datos
* Recolecci√≥n de los datos

#### Borrado de valores que faltan

In [18]:
#axis 0 filas y 1 columnas, all si todas son NA las borra (how)
data.dropna(axis=0, how="all")

      pclass  survived  ...   body                        home.dest
0          1         1  ...    NaN                     St Louis, MO
1          1         1  ...    NaN  Montreal, PQ / Chesterville, ON
2          1         0  ...    NaN  Montreal, PQ / Chesterville, ON
3          1         0  ...  135.0  Montreal, PQ / Chesterville, ON
4          1         0  ...    NaN  Montreal, PQ / Chesterville, ON
...      ...       ...  ...    ...                              ...
1304       3         0  ...  328.0                              NaN
1305       3         0  ...    NaN                              NaN
1306       3         0  ...  304.0                              NaN
1307       3         0  ...    NaN                              NaN
1308       3         0  ...    NaN                              NaN

[1309 rows x 14 columns]

In [19]:
data2 = data

In [20]:
data2.dropna(axis=0, how="any")

Empty DataFrame
Columns: [pclass, survived, name, sex, age, sibsp, parch, ticket, fare, cabin, embarked, boat, body, home.dest]
Index: []

#### Computo de los valores faltantes

In [21]:
data3 = data

In [22]:
data3.fillna(0)

      pclass  survived  ...   body                        home.dest
0          1         1  ...    0.0                     St Louis, MO
1          1         1  ...    0.0  Montreal, PQ / Chesterville, ON
2          1         0  ...    0.0  Montreal, PQ / Chesterville, ON
3          1         0  ...  135.0  Montreal, PQ / Chesterville, ON
4          1         0  ...    0.0  Montreal, PQ / Chesterville, ON
...      ...       ...  ...    ...                              ...
1304       3         0  ...  328.0                                0
1305       3         0  ...    0.0                                0
1306       3         0  ...  304.0                                0
1307       3         0  ...    0.0                                0
1308       3         0  ...    0.0                                0

[1309 rows x 14 columns]

In [23]:
data4=data

In [24]:
data4.fillna("Desconocido")

      pclass  survived  ...         body                        home.dest
0          1         1  ...  Desconocido                     St Louis, MO
1          1         1  ...  Desconocido  Montreal, PQ / Chesterville, ON
2          1         0  ...  Desconocido  Montreal, PQ / Chesterville, ON
3          1         0  ...          135  Montreal, PQ / Chesterville, ON
4          1         0  ...  Desconocido  Montreal, PQ / Chesterville, ON
...      ...       ...  ...          ...                              ...
1304       3         0  ...          328                      Desconocido
1305       3         0  ...  Desconocido                      Desconocido
1306       3         0  ...          304                      Desconocido
1307       3         0  ...  Desconocido                      Desconocido
1308       3         0  ...  Desconocido                      Desconocido

[1309 rows x 14 columns]

In [25]:
data5 = data

In [26]:
data5["body"] = data5["body"].fillna(0)
data5["home.dest"] = data5["home.dest"].fillna("Desconocido")
data5.head(20)

    pclass  survived  ...   body                        home.dest
0        1         1  ...    0.0                     St Louis, MO
1        1         1  ...    0.0  Montreal, PQ / Chesterville, ON
2        1         0  ...    0.0  Montreal, PQ / Chesterville, ON
3        1         0  ...  135.0  Montreal, PQ / Chesterville, ON
4        1         0  ...    0.0  Montreal, PQ / Chesterville, ON
5        1         1  ...    0.0                     New York, NY
6        1         1  ...    0.0                       Hudson, NY
7        1         0  ...    0.0                      Belfast, NI
8        1         1  ...    0.0              Bayside, Queens, NY
9        1         0  ...   22.0              Montevideo, Uruguay
10       1         0  ...  124.0                     New York, NY
11       1         1  ...    0.0                     New York, NY
12       1         1  ...    0.0                    Paris, France
13       1         1  ...    0.0                      Desconocido
14       1         1  ...    0.0                    Hessle, Yorks
15       1         0  ...    0.0                     New York, NY
16       1         0  ...    0.0                     Montreal, PQ
17       1         1  ...    0.0                     Montreal, PQ
18       1         1  ...    0.0                      Desconocido
19       1         0  ...    0.0                     Winnipeg, MN

[20 rows x 14 columns]

In [27]:
pd.isnull(data5["age"]).values.ravel().sum()

263

In [28]:
data5["age"].fillna(data5["age"].mean())

0       29.000000
1        0.916700
2        2.000000
3       30.000000
4       25.000000
          ...
1304    14.500000
1305    29.881135
1306    26.500000
1307    27.000000
1308    29.000000
Name: age, Length: 1309, dtype: float64

In [29]:
data5["age"][1291]

nan

In [30]:
# cercano hacia adelante ver 1304 y 1305
data5["age"].fillna(method="ffill")

0       29.0000
1        0.9167
2        2.0000
3       30.0000
4       25.0000
         ...
1304    14.5000
1305    14.5000
1306    26.5000
1307    27.0000
1308    29.0000
Name: age, Length: 1309, dtype: float64

In [31]:
# cercano hacia adelante ver 1305 y 1306
data5["age"].fillna(method="backfill")

0       29.0000
1        0.9167
2        2.0000
3       30.0000
4       25.0000
         ...
1304    14.5000
1305    26.5000
1306    26.5000
1307    27.0000
1308    29.0000
Name: age, Length: 1309, dtype: float64

#Variables dummy

In [36]:
data["sex"].head(10)

0    female
1      male
2    female
3      male
4    female
5      male
6    female
7      male
8    female
9      male
Name: sex, dtype: object

In [34]:
# crear dos nuevas variables entre 1 y 0 Dummyficacion
dummy_sex = pd.get_dummies(data["sex"], prefix="sex")

In [37]:
dummy_sex.head(10)

   sex_female  sex_male
0           1         0
1           0         1
2           1         0
3           0         1
4           1         0
5           0         1
6           1         0
7           0         1
8           1         0
9           0         1

In [38]:
column_name=data.columns.values.tolist()

In [39]:
column_name

['pclass',
 'survived',
 'name',
 'sex',
 'age',
 'sibsp',
 'parch',
 'ticket',
 'fare',
 'cabin',
 'embarked',
 'boat',
 'body',
 'home.dest']

In [41]:
## borrando la columna sex
data = data.drop(["sex"],axis=1)

In [42]:
#asignando a la columna dummy sex
pd.concat([data,dummy_sex],axis = 1)

      pclass  survived  ... sex_female  sex_male
0          1         1  ...          1         0
1          1         1  ...          0         1
2          1         0  ...          1         0
3          1         0  ...          0         1
4          1         0  ...          1         0
...      ...       ...  ...        ...       ...
1304       3         0  ...          1         0
1305       3         0  ...          1         0
1306       3         0  ...          0         1
1307       3         0  ...          0         1
1308       3         0  ...          0         1

[1309 rows x 15 columns]

In [44]:
def createDummies(df, var_name):
  dummy=pd.get_dummies(df[var_name], prefix=var_name)
  df=df.drop(var_name, axis=1)
  df=pd.concat([df, dummy], axis=1)
  return df

In [45]:
createDummies(data3, "sex")

      pclass  survived  ... sex_female  sex_male
0          1         1  ...          1         0
1          1         1  ...          0         1
2          1         0  ...          1         0
3          1         0  ...          0         1
4          1         0  ...          1         0
...      ...       ...  ...        ...       ...
1304       3         0  ...          1         0
1305       3         0  ...          1         0
1306       3         0  ...          0         1
1307       3         0  ...          0         1
1308       3         0  ...          0         1

[1309 rows x 15 columns]